==================
true
==================

true

---

(source_file (expression (bool_literal)))


==================
false
==================

false

---

(source_file (expression (bool_literal)))


==================
TRUE (error)
==================

TRUE

---

(source_file
  (ERROR)
)


==================
FALSE (error)
==================

FALSE

---

(source_file
  (ERROR)
)


==================
True (error)
==================

True

---

(source_file
  (ERROR)
)

==================
False (error)
==================

False

---

(source_file
  (ERROR)
)