==================
empty string
==================

""

---

(source_file
  (expression (simple_expression (string_literal (symbol) (symbol))))
)


==================
basic string
==================

"hello, world"

---

(source_file
  (expression
    (simple_expression (string_literal (symbol) (string_content) (symbol)))
  )
)



==================
string with escape
==================

"hello\tworld"

---

(source_file
  (expression
    (simple_expression (string_literal
      (symbol)
      (string_content (char_or_string_escape_sequence))
      (symbol)
    ))
  )
)


==================
EGC
==================

"üë©‚Äçüë©‚Äçüëß‚Äçüë¶"

---

(source_file
  (expression
    (simple_expression
      (string_literal
        symbol_open_quote: (symbol)
        content: (string_content)
        symbol_close_quote: (symbol)
      )
    )
  )
)


==================
unicode
==================

"≈º√≥≈Çw"

---

(source_file
  (expression
    (simple_expression
      (string_literal
        symbol_open_quote: (symbol)
        content: (string_content)
        symbol_close_quote: (symbol)
      )
    )
  )
)